In [2]:
import pandas as pd
df=pd.read_csv("titanic.csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [3]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [4]:
dummies=pd.get_dummies(df.Sex)
dummies

     female  male
0         0     1
1         1     0
2         1     0
3         1     0
4         0     1
..      ...   ...
886       0     1
887       1     0
888       1     0
889       0     1
890       0     1

[891 rows x 2 columns]

In [5]:
df.drop('Sex',axis='columns',inplace=True)

In [6]:
df=pd.concat([df,dummies],axis='columns')

In [7]:
df.head()

   Pclass   Age     Fare  Survived  female  male
0       3  22.0   7.2500         0       0     1
1       1  38.0  71.2833         1       1     0
2       3  26.0   7.9250         1       1     0
3       1  35.0  53.1000         1       1     0
4       3  35.0   8.0500         0       0     1

In [11]:
df.columns[df.isna().any()]

Index(['Age'], dtype='object')

In [12]:
df.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [15]:
df.Age=df.Age.fillna(df.Age.mean())

In [16]:
df.Age[:10]

0    22.000000
1    38.000000
2    26.000000
3    35.000000
4    35.000000
5    29.699118
6    54.000000
7     2.000000
8    27.000000
9    14.000000
Name: Age, dtype: float64

In [18]:
x=df.drop('Survived',axis='columns')
y=df.Survived

In [29]:
from sklearn.model_selection import train_test_split
xtrain,xtest,ytrain,ytest=train_test_split(x,y,test_size=0.1)

In [30]:
from sklearn.naive_bayes import GaussianNB
model=GaussianNB()
model.fit(xtrain,ytrain)
model.score(xtest,ytest)

0.8777777777777778

In [31]:
model.predict(xtest)

array([0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 1, 0, 0, 1,
       0, 0, 0, 1, 1, 0, 0, 1, 1, 0, 0, 1, 0, 1, 0, 0, 1, 1, 0, 0, 1, 1,
       0, 1, 0, 1, 1, 0, 1, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0,
       0, 1, 0, 1, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 1, 1, 0, 1, 1,
       0, 0], dtype=int64)

In [32]:
ytest

0      0
490    0
740    1
215    1
26     0
      ..
434    0
644    1
448    1
466    0
157    0
Name: Survived, Length: 90, dtype: int64

In [33]:
model.predict_proba(xtest[:10])

array([[9.85437523e-01, 1.45624770e-02],
       [9.86965575e-01, 1.30344252e-02],
       [9.05543194e-01, 9.44568065e-02],
       [4.14071461e-04, 9.99585929e-01],
       [9.86912043e-01, 1.30879566e-02],
       [7.67129991e-02, 9.23287001e-01],
       [9.86344867e-01, 1.36551329e-02],
       [9.04577532e-01, 9.54224680e-02],
       [9.82929822e-01, 1.70701776e-02],
       [7.84160666e-01, 2.15839334e-01]])